In [24]:
import pymysql
import pandas as pd
import getpass
host = 'db.ust-db.link'
user = 'kopinss'
password = getpass.getpass()

········

In [25]:
pymysql.install_as_MySQLdb()
# establish a database connection
connection_string = f"mysql://{user}:{password}@{host}"

In [26]:
%load_ext sql
%config SQLMagic.autocommit=True
%sql $connection_string

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [48]:
%%sql 
USE shared_sakila

 * mysql://kopinss:***@db.ust-db.link
0 rows affected.

[]

In [52]:
# Problem 1

In [31]:
%%sql

SELECT store.store_id, staff.first_name AS manager_first_name, staff.last_name AS manager_last_name, address.address, city.city, country.country, address.postal_code FROM store
INNER JOIN staff ON staff.staff_id = store.manager_staff_id
INNER JOIN address ON store.address_id = address.address_id
INNER JOIN city ON city.city_id = address.city_id
INNER JOIN country ON country.country_id = city.country_id;

 * mysql://kopinss:***@db.ust-db.link
2 rows affected.

[(1, 'Mike', 'Hillyer', '47 MySakila Drive', 'Lethbridge', 'Canada', ''),
 (2, 'Jon', 'Stephens', '28 MySQL Boulevard', 'Woodridge', 'Australia', '')]

In [51]:
## Problem 2

In [32]:
%%sql

SELECT payment.payment_id, payment.payment_date, 
	   customer.first_name AS customer_first_name, 
       customer.last_name AS customer_last_name, 
       staff.first_name AS staff_first_name,
       staff.last_name AS staff_last_name,
       payment.amount FROM payment

INNER JOIN customer ON customer.customer_id = payment.customer_id
INNER JOIN staff ON staff.staff_id = payment.staff_id

WHERE payment.amount >= 11.00 ;

 * mysql://kopinss:***@db.ust-db.link
10 rows affected.

[(8272, datetime.datetime(2005, 6, 17, 23, 51, 21), 'RICHARD', 'MCCRARY', 'Mike', 'Hillyer', Decimal('11.99')),
 (9803, datetime.datetime(2005, 8, 21, 23, 28, 58), 'NICHOLAS', 'BARFIELD', 'Mike', 'Hillyer', Decimal('11.99')),
 (15850, datetime.datetime(2005, 7, 6, 22, 58, 31), 'TERRANCE', 'ROUSH', 'Mike', 'Hillyer', Decimal('11.99')),
 (342, datetime.datetime(2005, 7, 29, 22, 37, 41), 'KAREN', 'JACKSON', 'Jon', 'Stephens', Decimal('11.99')),
 (3146, datetime.datetime(2005, 8, 21, 23, 34), 'VICTORIA', 'GIBSON', 'Jon', 'Stephens', Decimal('11.99')),
 (5280, datetime.datetime(2005, 8, 23, 22, 19, 33), 'VANESSA', 'SIMS', 'Jon', 'Stephens', Decimal('11.99')),
 (5281, datetime.datetime(2005, 5, 25, 18, 18, 19), 'ALMA', 'AUSTIN', 'Jon', 'Stephens', Decimal('11.99')),
 (5550, datetime.datetime(2005, 8, 22, 23, 48, 56), 'ROSEMARY', 'SCHMIDT', 'Jon', 'Stephens', Decimal('11.99')),
 (6409, datetime.datetime(2005, 8, 2, 22, 18, 13), 'TANYA', 'GILBERT', 'Jon', 'Stephens', Decimal('11.99')),
 (15821, datetime.datetime(2005, 7, 7, 20, 45, 51), 'KENT', 'ARSENAULT', 'Jon', 'Stephens', Decimal('11.99'))]

In [53]:
## Problem 3

In [33]:
%%sql

SELECT payment.payment_id, payment.payment_date, 
	   customer.first_name AS customer_first_name, 
       customer.last_name AS customer_last_name,
       payment.amount
       FROM payment

INNER JOIN customer ON customer.customer_id = payment.customer_id

WHERE payment.amount >= 11.00

 * mysql://kopinss:***@db.ust-db.link
10 rows affected.

[(342, datetime.datetime(2005, 7, 29, 22, 37, 41), 'KAREN', 'JACKSON', Decimal('11.99')),
 (3146, datetime.datetime(2005, 8, 21, 23, 34), 'VICTORIA', 'GIBSON', Decimal('11.99')),
 (5280, datetime.datetime(2005, 8, 23, 22, 19, 33), 'VANESSA', 'SIMS', Decimal('11.99')),
 (5281, datetime.datetime(2005, 5, 25, 18, 18, 19), 'ALMA', 'AUSTIN', Decimal('11.99')),
 (5550, datetime.datetime(2005, 8, 22, 23, 48, 56), 'ROSEMARY', 'SCHMIDT', Decimal('11.99')),
 (6409, datetime.datetime(2005, 8, 2, 22, 18, 13), 'TANYA', 'GILBERT', Decimal('11.99')),
 (8272, datetime.datetime(2005, 6, 17, 23, 51, 21), 'RICHARD', 'MCCRARY', Decimal('11.99')),
 (9803, datetime.datetime(2005, 8, 21, 23, 28, 58), 'NICHOLAS', 'BARFIELD', Decimal('11.99')),
 (15821, datetime.datetime(2005, 7, 7, 20, 45, 51), 'KENT', 'ARSENAULT', Decimal('11.99')),
 (15850, datetime.datetime(2005, 7, 6, 22, 58, 31), 'TERRANCE', 'ROUSH', Decimal('11.99'))]

In [54]:
%%sql 
USE shared_sales

 * mysql://kopinss:***@db.ust-db.link
0 rows affected.

[]

In [55]:
## Problem 4

In [38]:
%%sql

SELECT product.product_name, category.category_description 
	FROM product

INNER JOIN category ON category.category_id = product.category_id;

 * mysql://kopinss:***@db.ust-db.link
40 rows affected.

[('Dog Ear Cyclecomputer', 'Accessories'),
 ('Dog Ear Helmet Mount Mirrors', 'Accessories'),
 ('Viscount C-500 Wireless Bike Computer', 'Accessories'),
 ('Kryptonite Advanced 2000 U-Lock', 'Accessories'),
 ('Nikoma Lok-Tight U-Lock', 'Accessories'),
 ('Viscount Microshell Helmet', 'Accessories'),
 ('Viscount CardioSport Sport Watch', 'Accessories'),
 ('Viscount Tru-Beat Heart Transmitter', 'Accessories'),
 ('Dog Ear Monster Grip Gloves', 'Accessories'),
 ('Dog Ear Aero-Flow Floor Pump', 'Accessories'),
 ("Pro-Sport 'Dillo Shades", 'Accessories'),
 ('King Cobra Helmet', 'Accessories'),
 ('Glide-O-Matic Cycling Helmet', 'Accessories'),
 ('Clear Shade 85-T Glasses', 'Accessories'),
 ('True Grip Competition Gloves', 'Accessories'),
 ('TransPort Bicycle Rack', 'Accessories'),
 ('HP Deluxe Panniers', 'Accessories'),
 ('Cycle-Doc Pro Repair Stand', 'Accessories'),
 ('Trek 9000 Mountain Bike', 'Bikes'),
 ('Eagle FS-3 Mountain Bike', 'Bikes'),
 ('Viscount Mountain Bike', 'Bikes'),
 ('GT RTS-2 Mountain Bike', 'Bikes'),
 ('Ultra-Pro Rain Jacket', 'Clothing'),
 ('StaDry Cycling Pants', 'Clothing'),
 ('Kool-Breeze Rocket Top Jersey', 'Clothing'),
 ('Wonder Wool Cycle Socks', 'Clothing'),
 ('Victoria Pro All Weather Tires', 'Components'),
 ('Shinoman 105 SC Brakes', 'Components'),
 ('Shinoman Dura-Ace Headset', 'Components'),
 ('Eagle SA-120 Clipless Pedals', 'Components'),
 ('ProFormance Toe-Klips 2G', 'Components'),
 ('ProFormance ATB All-Terrain Pedal', 'Components'),
 ('Shinoman Deluxe TX-30 Pedal', 'Components'),
 ('Cosmic Elite Road Warrior Wheels', 'Components'),
 ('AeroFlo ATB Wheels', 'Components'),
 ('Road Warrior Hitch Pack', 'Car racks'),
 ('Ultimate Export 2G Car Rack', 'Car racks'),
 ('X-Pro All Weather Tires', 'Tires'),
 ('Turbo Twin Tires', 'Tires'),
 ('Ultra-2K Competition Tire', 'Tires')]

In [56]:
##problem 5

In [40]:
%%sql

SELECT order__item.order_number, product.product_name, order__item.quantity_ordered,
order__item.quoted_price AS quoted_price_each,
order__item.quantity_ordered * order__item.quoted_price AS total_amount_owed
	FROM product
INNER JOIN order__item ON order__item.product_number = product.product_number
WHERE order__item.order_number = 160;

 * mysql://kopinss:***@db.ust-db.link
8 rows affected.

[(160, 'Trek 9000 Mountain Bike', 1, Decimal('1200.00'), Decimal('1200.00')),
 (160, 'Viscount Mountain Bike', 1, Decimal('635.00'), Decimal('635.00')),
 (160, 'GT RTS-2 Mountain Bike', 5, Decimal('1600.50'), Decimal('8002.50')),
 (160, 'ProFormance ATB All-Terrain Pedal', 1, Decimal('28.00'), Decimal('28.00')),
 (160, 'Dog Ear Aero-Flow Floor Pump', 2, Decimal('55.00'), Decimal('110.00')),
 (160, 'Glide-O-Matic Cycling Helmet', 6, Decimal('121.25'), Decimal('727.50')),
 (160, 'True Grip Competition Gloves', 3, Decimal('22.00'), Decimal('66.00')),
 (160, 'Cosmic Elite Road Warrior Wheels', 5, Decimal('160.05'), Decimal('800.25'))]

In [57]:
## Problem 6

In [41]:
%%sql

SELECT customer_first_name, customer_last_name FROM customer WHERE customer_id IN 
(SELECT DISTINCT customer_id FROM `order` WHERE order_number IN 
(SELECT order_number FROM order__item WHERE order__item.product_number IN 
(SELECT product.product_number FROM product WHERE product.category_id =  (SELECT category.category_id from category WHERE category.category_description = "Bikes"))));

 * mysql://kopinss:***@db.ust-db.link
23 rows affected.

[('William', 'Thompson'),
 ('Robert', 'Brown'),
 ('Dean', 'McCrae'),
 ('John', 'Viescas'),
 ('Mariya', 'Sergienko'),
 ('Neil', 'Patterson'),
 ('Andrew', 'Cencini'),
 ('Angel', 'Kennedy'),
 ('Alaina', 'Hallmark'),
 ('Liz', 'Keyser'),
 ('Rachel', 'Patterson'),
 ('Sam', 'Abolrous'),
 ('Jim', 'Wilson'),
 ('Manuela', 'Seidel'),
 ('David', 'Smith'),
 ('Zachary', 'Ehrlich'),
 ('Joyce', 'Bonnicksen'),
 ('Estella', 'Pundt'),
 ('Julia', 'Schnebly'),
 ('Mark', 'Rosales'),
 ('Maria', 'Patterson'),
 ('Kirk', 'DeGrasse'),
 ('Luke', 'Patterson')]

In [58]:
## Problem 7

In [42]:
%%sql

SELECT product_name FROM product WHERE product_number IN   
(SELECT product_number FROM product WHERE product_number NOT IN 
(SELECT DISTINCT product_number FROM order__item));

 * mysql://kopinss:***@db.ust-db.link
2 rows affected.

[('Victoria Pro All Weather Tires',), ('Ultra-Pro Rain Jacket',)]

In [59]:
## Problem 8

In [68]:
%%sql

SELECT customer_first_name, customer_last_name FROM customer WHERE customer_id NOT IN
(SELECT DISTINCT customer_id FROM shared_sales.order);

 * mysql://kopinss:***@db.ust-db.link
1 rows affected.

[('Jeffrey', 'Tirekicker')]

In [60]:
## Problem 9

In [44]:
%%sql

SELECT customer.customer_first_name, customer.customer_last_name, employee.employee_first_name, employee.employee_last_name FROM customer
    JOIN employee ON employee.employee_last_name = customer.customer_last_name;

 * mysql://kopinss:***@db.ust-db.link
16 rows affected.

[('Suzanne', 'Viescas', 'Carol', 'Viescas'),
 ('Suzanne', 'Viescas', 'David', 'Viescas'),
 ('William', 'Thompson', 'Mary', 'Thompson'),
 ('John', 'Viescas', 'Carol', 'Viescas'),
 ('John', 'Viescas', 'David', 'Viescas'),
 ('Neil', 'Patterson', 'Ann', 'Patterson'),
 ('Neil', 'Patterson', 'Kathryn', 'Patterson'),
 ('Rachel', 'Patterson', 'Ann', 'Patterson'),
 ('Rachel', 'Patterson', 'Kathryn', 'Patterson'),
 ('Caleb', 'Viescas', 'Carol', 'Viescas'),
 ('Caleb', 'Viescas', 'David', 'Viescas'),
 ('Maria', 'Patterson', 'Ann', 'Patterson'),
 ('Maria', 'Patterson', 'Kathryn', 'Patterson'),
 ('Kirk', 'DeGrasse', 'Kirk', 'DeGrasse'),
 ('Luke', 'Patterson', 'Ann', 'Patterson'),
 ('Luke', 'Patterson', 'Kathryn', 'Patterson')]

In [61]:
## Problem 10

In [45]:
%%sql

SELECT vendor_name FROM vendor WHERE vendor_id IN 
(SELECT vendor_id FROM product_vendor WHERE product_number IN 
(SELECT product_number FROM product WHERE category_id =
(SELECT category_id FROM category WHERE category_description = 'Clothing')));

 * mysql://kopinss:***@db.ust-db.link
4 rows affected.

[('Big Sky Mountain Bikes',),
 ('Dog Ear',),
 ('Sun Sports Suppliers',),
 ('Lone Star Bike Supply',)]